In [19]:
import pandas as pd
import numpy as np

df = pd.read_csv('data/updated_sample_data.csv')
print(df.head())

    Age   Salary  Experience   Department Purchased
0  25.0  50000.0         2.0           HR        No
1  30.0  60000.0         5.0  Engineering       Yes
2  35.0  65000.0         7.0    Marketing       Yes
3  40.0  70000.0        10.0        Sales        No
4  45.0  80000.0        12.0      Finance       Yes

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Age         9 non-null      float64
 1   Salary      8 non-null      float64
 2   Experience  9 non-null      float64
 3   Department  10 non-null     object
 4   Purchased   10 non-null     object
dtypes: float64(3), object(2)
memory usage: 532.0+ bytes

In [21]:
df.describe() #25% 50% 75% are quartiles

             Age         Salary  Experience
count   9.000000       8.000000    9.000000
mean   36.666667  150250.000000    7.666667
std     8.185353  230531.528677    4.092676
min    25.000000   50000.000000    2.000000
25%    30.000000   63750.000000    5.000000
50%    35.000000   68500.000000    7.000000
75%    42.000000   82500.000000   10.000000
max    50.000000  720000.000000   15.000000

In [22]:
df.isnull() # assigns as True each na value, else as False

     Age  Salary  Experience  Department  Purchased
0  False   False       False       False      False
1  False   False       False       False      False
2  False   False       False       False      False
3  False   False       False       False      False
4  False   False       False       False      False
5  False   False       False       False      False
6  False    True       False       False      False
7  False   False       False       False      False
8   True   False       False       False      False
9  False    True        True       False      False

In [23]:

df.isnull().sum(axis=1) # #Returns the summation of na values per row

0    0
1    0
2    0
3    0
4    0
5    0
6    1
7    0
8    1
9    2
dtype: int64

In [24]:
df.isnull().sum() #Returns the summation of na values per columns

Age           1
Salary        2
Experience    1
Department    0
Purchased     0
dtype: int64

In [25]:
missing_rows = df.isnull().any(axis=1) # selecting rows with na values as true else as false. any() would do same but in the column axis
missing_rows

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8     True
9     True
dtype: bool

In [26]:
df_missing_rows = df[missing_rows] #creating a df with the missing_rows
df_missing_rows

    Age    Salary  Experience        Department Purchased
6  29.0       NaN         4.0                HR        No
8   NaN  720000.0         6.0  Machine Learning        No
9  42.0       NaN         NaN           Finance       Yes

In [27]:
#df['Salary'].fillna(0, inplace=True) #fill all na Salary values with 0
# df.loc[8, 'Salary'] = 0 # fill na Salary value index 8 with 0
#df['Age'].fillna(df['Age'].mean(), inplace=True) #Fill all na Age values with mean Age
df.loc[8, 'Age'] = df['Age'].mean() # fill na Age value index 8 with mean Age
df.loc[6, 'Salary'] = df['Salary'].median()

In [28]:
# before droping all rows with na values I fill the na values in rows I wanted to keep
df.dropna(inplace = True) # drop all rows with na values

In [29]:
df

         Age    Salary  Experience        Department Purchased
0  25.000000   50000.0         2.0                HR        No
1  30.000000   60000.0         5.0       Engineering       Yes
2  35.000000   65000.0         7.0         Marketing       Yes
3  40.000000   70000.0        10.0             Sales        No
4  45.000000   80000.0        12.0           Finance       Yes
5  50.000000   90000.0        15.0       Engineering       Yes
6  29.000000   68500.0         4.0                HR        No
7  34.000000   67000.0         8.0             Sales       Yes
8  36.666667  720000.0         6.0  Machine Learning        No

In [30]:
import pandas as pd
import numpy as np

data = {'A': [1, 2, np.nan, 4, 5, np.nan, 7, 8], 'B': [1, np.nan, 3, 4, 5, np.nan, 7, 8]}
df2 = pd.DataFrame(data)
df2

     A    B
0  1.0  1.0
1  2.0  NaN
2  NaN  3.0
3  4.0  4.0
4  5.0  5.0
5  NaN  NaN
6  7.0  7.0
7  8.0  8.0

In [33]:
df2['A'] = df2['A'].interpolate(method = 'linear') #fills na values linearly based on neighbors avarage
df2

     A    B
0  1.0  1.0
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  5.0  5.0
5  6.0  6.0
6  7.0  7.0
7  8.0  8.0